platformio/platform-ststm32/misc/svd/STM32F778.svd
        <register>
          <name>HUFFSYMB48</name>
          <displayName>HUFFSYMB48</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB49</name>
          <displayName>HUFFSYMB49</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB50</name>
          <displayName>HUFFSYMB50</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB51</name>
          <displayName>HUFFSYMB51</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB52</name>
          <displayName>HUFFSYMB52</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB53</name>
          <displayName>HUFFSYMB53</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB54</name>
          <displayName>HUFFSYMB54</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB55</name>
          <displayName>HUFFSYMB55</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB56</name>
          <displayName>HUFFSYMB56</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB57</name>
          <displayName>HUFFSYMB57</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB58</name>
          <displayName>HUFFSYMB58</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB59</name>
          <displayName>HUFFSYMB59</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB60</name>
          <displayName>HUFFSYMB60</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB61</name>
          <displayName>HUFFSYMB61</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB62</name>
          <displayName>HUFFSYMB62</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB63</name>
          <displayName>HUFFSYMB63</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB64</name>
          <displayName>HUFFSYMB64</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB65</name>
          <displayName>HUFFSYMB65</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB66</name>
          <displayName>HUFFSYMB66</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB67</name>
          <displayName>HUFFSYMB67</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB68</name>
          <displayName>HUFFSYMB68</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB69</name>
          <displayName>HUFFSYMB69</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB70</name>
          <displayName>HUFFSYMB70</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB71</name>
          <displayName>HUFFSYMB71</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB72</name>
          <displayName>HUFFSYMB72</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB73</name>
          <displayName>HUFFSYMB73</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB74</name>
          <displayName>HUFFSYMB74</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB75</name>
          <displayName>HUFFSYMB75</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x33C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB76</name>
          <displayName>HUFFSYMB76</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB77</name>
          <displayName>HUFFSYMB77</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB78</name>
          <displayName>HUFFSYMB78</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB79</name>
          <displayName>HUFFSYMB79</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB80</name>
          <displayName>HUFFSYMB80</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB81</name>
          <displayName>HUFFSYMB81</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB82</name>
          <displayName>HUFFSYMB82</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB83</name>
          <displayName>HUFFSYMB83</displayName>
          <description>JPEG HUFFSYMB tables</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HuffSymb_RAM</name>
              <description>DHTSymb RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM0</name>
          <displayName>DHTMEM0</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM2</name>
          <displayName>DHTMEM2</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM3</name>
          <displayName>DHTMEM3</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHTMEM4</name>
          <displayName>DHTMEM4</displayName>
          <description>JPEG DHTMem tables</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
