platformio/platform-ststm32/misc/svd/STM32F778.svd
        <register>
          <name>HUFFENC_AC1_13</name>
          <displayName>HUFFENC_AC1_13</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_14</name>
          <displayName>HUFFENC_AC1_14</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_15</name>
          <displayName>HUFFENC_AC1_15</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_16</name>
          <displayName>HUFFENC_AC1_16</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_17</name>
          <displayName>HUFFENC_AC1_17</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_18</name>
          <displayName>HUFFENC_AC1_18</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_19</name>
          <displayName>HUFFENC_AC1_19</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_20</name>
          <displayName>HUFFENC_AC1_20</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_21</name>
          <displayName>HUFFENC_AC1_21</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_22</name>
          <displayName>HUFFENC_AC1_22</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_23</name>
          <displayName>HUFFENC_AC1_23</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_24</name>
          <displayName>HUFFENC_AC1_24</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_25</name>
          <displayName>HUFFENC_AC1_25</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_26</name>
          <displayName>HUFFENC_AC1_26</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_27</name>
          <displayName>HUFFENC_AC1_27</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_28</name>
          <displayName>HUFFENC_AC1_28</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_29</name>
          <displayName>HUFFENC_AC1_29</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_30</name>
          <displayName>HUFFENC_AC1_30</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_31</name>
          <displayName>HUFFENC_AC1_31</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_32</name>
          <displayName>HUFFENC_AC1_32</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_33</name>
          <displayName>HUFFENC_AC1_33</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_34</name>
          <displayName>HUFFENC_AC1_34</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_35</name>
          <displayName>HUFFENC_AC1_35</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_36</name>
          <displayName>HUFFENC_AC1_36</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_37</name>
          <displayName>HUFFENC_AC1_37</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_38</name>
          <displayName>HUFFENC_AC1_38</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_39</name>
          <displayName>HUFFENC_AC1_39</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x6FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_40</name>
          <displayName>HUFFENC_AC1_40</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_41</name>
          <displayName>HUFFENC_AC1_41</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_42</name>
          <displayName>HUFFENC_AC1_42</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_43</name>
          <displayName>HUFFENC_AC1_43</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_44</name>
          <displayName>HUFFENC_AC1_44</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_45</name>
          <displayName>HUFFENC_AC1_45</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_46</name>
          <displayName>HUFFENC_AC1_46</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_47</name>
          <displayName>HUFFENC_AC1_47</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x71C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_48</name>
          <displayName>HUFFENC_AC1_48</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_49</name>
          <displayName>HUFFENC_AC1_49</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_50</name>
          <displayName>HUFFENC_AC1_50</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1_51</name>
          <displayName>HUFFENC_AC1_51</displayName>
          <description>JPEG encoder, AC Huffman table
          1</description>
          <addressOffset>0x72C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DHTMem_RAM</name>
              <description>DHTMem RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
